dict ={
#ア行
"ア": "\xb1",
"イ": "\xb2",
"ウ": "\xb3",
"エ": "\xb4",
"オ": "\xb5",
#カ行
"カ": "\xb6",
"キ": "\xb7",
"ク": "\xb8",
"ケ": "\xb9",
"コ": "\xba",
#縺戊｡?
"サ": "\xbb",
"シ": "\xbc",
"ス": "\xbd",
"セ": "\xbe",
"ソ": "\xbf",
#縺溯｡?
"タ": "\xc0",
"チ": "\xc1",
"ツ": "\xc2",
"テ": "\xc3",
"ト": "\xc4",
#縺ｪ陦?
"ナ": "\xc5",
"ニ": "\xc6",
"ヌ": "\xc7",
"ネ": "\xc8",
"ノ": "\xc9",
#縺ｯ陦?
"ハ": "\xca",
"ヒ": "\xcb",
"フ": "\xcc",
"ヘ": "\xcd",
"ホ": "\xce",
#縺ｾ陦?
"マ": "\xcf",
"ミ": "\xd0",
"ム": "\xd1",
"メ": "\xd2",
"モ": "\xd3",
#繧?陦?
"ヤ": "\xd4",
"ユ": "\xd5",
"ヨ": "\xd6",
#繧芽｡?
"ラ": "\xd7",
"リ": "\xd8",
"ル": "\xd9",
"レ": "\xda",
"ロ": "\xdb",
#繧剰｡?
"ワ": "\xca",
"ヲ": "\xa6",
"ン": "\xdd",



"ァ": "\xa7",
"ィ": "\xa8",
"ゥ": "\xa9",
"ェ": "\xaa",
"ォ": "\xab",
"ャ": "\xac",
"ュ": "\xab",
"ョ": "\xae",
"ッ": "\xaf",
"。": "\xa1",
"、": "\xa4",
"゛": "\xde",
"゜": "\xdf",
}